##################################################################################################
## 입력 : 첫째 줄에  정수 N이 주어짐(1<=N<=23)
## 출력 : 00시 00 분 00초 부터 N시 59분 59초 까지의 모든 시각 중에서 3이 하나라도 포함되는 모든 경우의 수 출력
##################################################################################################
# 완전 탐색(구현)

n = int(input()) # 입력 
count = 0
for i in range(n+1):

    for j in range(60):

        for k in range(60):
            if '3' in str(i)+str(j)+str(k) : count += 1



print(count)
